{
    "Aries": "Internal reflections prove powerful today. Prepare for a burst of illumination when Mercury fuses together with the enlightening sun.\n\nCaught up in the vision? There may be more to it than meets the eye. Take what you intuit to heart now. The message received is showing you possibilities.",
    "Taurus": "Aspirations reach a peak point of perception. Mercury joins the sun to boost the realization of your hopes and dreams.\n\nCommunity plays a role here. Who’s on your team? Reach out to allies who are crucial to your ability to network. Success isn’t achieved solely on your own.",
    "Gemini": "Life direction on your mind? The path can be clear and murky at the same time. Rely on intuition instead.\n\nTrade thoughts in for visions now. Answers are in the imagination as Mercury meets the sun. Watch for clues that come into your head in picture form.",
    "Cancer": "Tap into your innate spiritual knowledge. Your ability to comprehend abstract awareness is strong as Mercury merges with the sun.\n\nLooking to know more? Expand beyond your frame of reference. Connecting with a mentor can be highly enriching. Be open to broadened horizons.",
    "Leo": "You cross a mental threshold today. Transition and rebirth are topics of focus while Mercury fuses with the sun.\n\nWipe the slate clean. Ready for a beginner’s mind? Opt for fresh thinking. Transcend what you thought you knew to see life through new eyes.",
    "Virgo": "Communications in partnership can be tense now. Holding separate viewpoints? Mercury joins the sun to expose ways of thinking.\n\nListen to what others have to say with compassion. It’s best to focus on the middle ground. Deep down you’ll sense an acceptable compromise.",
    "Libra": "Imagine how to setup your ideal life flow. Mercury merges with the sun today to illuminate rituals and strategies.\n\nLook at the decisions you’ve been making with work and health. Are they aligned with what you’d like them to be? If not, choose to birth new conditions.",
    "Scorpio": "A passion project may need a last big push. Get creative with the finishing touches as Mercury joins the sun.\n\nWhat do you need to reach the end? Pair imagination with concrete strategy. It may feel intellectually overwhelming but a defined plan will get you on track.",
    "Sagittarius": "Discussions are happening at a foundational level. Home and family decisions come to a head while Mercury meets the sun.\n\nThe important thing here is to get everyone on the same page. Who’s still in the dark? Take the initiative to inform everyone. Be kind in the process.",
    "Capricorn": "Prepare for an interactive day! You may have your communicative work cut out for you when Mercury conjoins the sun.\n\nIt can feel like a bit much. Procrastination will tempt you but don’t give in. Ready to go with the flow? Choose where to start and the rest will fall into line.",
    "Aquarius": "Finances catching up with you? Mercury meeting the sun spotlights what you may have turned a blind eye to.\n\nInundation is real here. Muster up the strength to handle the situation. Close your eyes and intuit what needs your attention most. Go from there.",
    "Pisces": "Today is about decisive self-improvement. The sun and Mercury align to clarify choices that prioritize your happiness and well-being.\n\nNeed to fill others in? Expressing yourself comes with ease now. Share from the heart. Support is offered if you are forthright about your intentions."
}
